<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\CategoryGroup;

class CategoryGroupsSeeder extends Seeder
{
    public function run(): void
    {
        $categories = [
            'الدين الإسلامي والعلوم الشرعية',
            'السيرة النبوية و سيرة الصحابة',
            'الأنبياء و الرسل و الأقوام السابقة',
            'اللغة العربية',
            'لغات العالم و لغات الشعوب',
            'التربية و التعليم و التعلم',
            'العلوم الاجتماعية و المجتمع و الحياة الاجتماعية',
            'القانون و القضاء',
            'الفلسفة و المنطق',
            'علم النفس البشري',
            'التنمية البشرية و الموارد البشرية و تطوير الذات',
            'الإدارة و القيادة',
            'الاقتصاد و المال و الأعمال و التجارة و المحاسبة و المبيعات',
            'السياسة و العلوم السياسية',
            'الجغرافيا و المناخ و التضاريس',
            'علوم الأرض',
            'تاريخ الدول و الحضارات',
            'الحروب و النزاعات والعلوم العسكرية والحربية',
            'القارات',
            'السياحة و السفر و الرحلات',
            'الأدب العربي',
            'العلوم الطبيعية',
            'الهندسة',
            'الكيمياء',
            'الفيزياء',
            'الرياضيات',
            'الفلك و الفضاء',
            'الصناعات',
            'البرمجة',
            'الطب و الأمراض و التشريح و الصيدلة و العقاقير',
            'التفسير',
            'علوم القرآن و أصول التفسير',
            'علوم الفقه و القواعد الفقهية',
            'التجويد و القراءات',
            'كتب السنة',
            'شروح الحديث',
            'التخريج و الأطراف',
            'علوم الحديث',
            'العلل و السؤلات الحديثية',
            'أصول الفقه',
        ];

        foreach ($categories as $category) {
            CategoryGroup::create(['name' => $category]);
        }
    }
}
